src/cf/src/Catalogs/СостоянияЗадач/СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗадач</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаБизнесТестировании</name>
      <description>На бизнес-тестировании</description>
    </items>
    <items>
      <name>НаУточнении</name>
      <description>На уточнении</description>
    </items>
    <items>
      <name>НоваяЗадача</name>
      <description>Новая задача</description>
    </items>
    <items>
      <name>ОжиданиеПереносаИзменений</name>
      <description>Ожидание переноса изменений в продуктив</description>
    </items>
    <items>
      <name>ОтмененоВыполнение</name>
      <description>Отменено выполнение</description>
    </items>
    <items>
      <name>Приостановлена</name>
      <description>Приостановлена</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>ФормированиеТехническогоРешения</name>
      <description>Формирование тех. решения</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенСрокСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательнаПричинаИзмененияСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения100</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПриРасчетеВремениВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаСостояния</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьТекстЦвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Enums/ДоступностьПолей/ДоступностьПолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДоступностьПолей</name>
  <enumValues>
    <name>НеНазначено</name>
  </enumValues>
  <enumValues>
    <name>Доступно</name>
  </enumValues>
  <enumValues>
    <name>Недоступно</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/СостоянияЗадач/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Функция возвращает все новые актуальные состояния с учетом старых состояний
//
// Параметры:
//  МассивСостояний	 - Массив - массив СправочникСсылка.СостоянияЗадач старых состояний
//		Если не будет заполнено, то возвращаться будут все состояния
//	ТолькоНовые - Булево - по-умолчанию Ложь. Истина, будут выведены только состояния не входящие в  МассивСостояний
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблицы старых и обновленных состояний:
//		* Состояние - СправочникСсылка.СостоянияЗадач
//		* НовоеСостояние - Булево - Истина, в случае если в МассивСостояний не было ранее состояния
//
Функция ВсеАктуальныеСостояния(МассивСостояний = Неопределено, ТолькоНовые = Ложь) Экспорт
	
	Если МассивСостояний = Неопределено Тогда
		МассивСостояний = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияЗадач.Ссылка КАК Состояние,
	               |	ИСТИНА КАК НовоеСостояние,
	               |	ЗНАЧЕНИЕ(Перечисление.ДоступностьПолей.НеНазначено) КАК Доступность,
	               |	СостоянияЗадач.РеквизитДопУпорядочивания КАК Порядок,
	               |	СостоянияЗадач.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.СостоянияЗадач КАК СостоянияЗадач
	               |ГДЕ
	               |	НЕ СостоянияЗадач.Ссылка В (&МассивСостояний)
	               |	И НЕ СостоянияЗадач.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СостоянияЗадач.Ссылка,
	               |	ЛОЖЬ,
	               |	ЗНАЧЕНИЕ(Перечисление.ДоступностьПолей.НеНазначено),
	               |	СостоянияЗадач.РеквизитДопУпорядочивания,
	               |	СостоянияЗадач.Наименование
	               |ИЗ
	               |	Справочник.СостоянияЗадач КАК СостоянияЗадач
	               |ГДЕ
	               |	СостоянияЗадач.Ссылка В(&МассивСостояний)
	               |	И (&ТолькоНовые = ЛОЖЬ
	               |			ИЛИ &ТолькоНовые = ИСТИНА
	               |				И ЛОЖЬ)
	               |	И НЕ СостоянияЗадач.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	Запрос.УстановитьПараметр("ТолькоНовые", ТолькоНовые);
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить();

КонецФункции // ВсеАктуальныеСостояния()

#КонецОбласти

#КонецЕсли
